sengeiou/sln_tlhmi_iot/cm4/board/pin_mux.c
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MIMXRT1176xxxxx
package_id: MIMXRT1176DVMAA
mcu_data: ksdk2_0
processor_version: 0.9.6
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "board_define.h"
#include "board.h"
#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
#if TARGET_BOARD == BOARD_SMART_TLHMI
    BOARD_InitLpuartPins();
    BOARD_InitMipiPanelPins();
    BOARD_InitParallelCameraPins();
    BOARD_InitFlexioCameraPins();
#ifdef ENABLE_OUTPUT_DEV_RgbLed
    BOARD_InitRGBLedPins();
#endif /* ENABLE_OUTPUT_DEV_RgbLed */
#endif /* TARGET_BOARD == BOARD_SMART_TLHMI */

#if TARGET_BOARD == BOARD_1170EVK
    BOARD_InitLpuartPins();
    BOARD_InitMipiPanelPins();
    BOARD_InitMipiCameraPins();
#endif
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitRGBLedPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitRGBLedPins(void) {

#if TARGET_BOARD == BOARD_1170EVK
#elif TARGET_BOARD == BOARD_SMART_TLHMI
    /* Green LED */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B2_01_GPIO_MUX2_IO11,   /* GPIO_EMC_B2_01 is configured as GPIO_MUX2_IO11 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */

    /* Red LED */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B2_00_GPIO_MUX2_IO10,   /* GPIO_EMC_B2_00 is configured as GPIO_MUX2_IO10 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */

    /* Blue LED */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B2_02_GPIO_MUX2_IO12,   /* GPIO_EMC_B2_02 is configured as GPIO_MUX2_IO12 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */

    IOMUXC_GPR->GPR40 = ((IOMUXC_GPR->GPR40 &
      (~(IOMUXC_GPR_GPR40_GPIO_MUX2_GPIO_SEL_LOW_MASK))) /* Mask bits to zero which are setting */
        | IOMUXC_GPR_GPR40_GPIO_MUX2_GPIO_SEL_LOW(0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
      );
#endif
}
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLpuartPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: M15, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AD_25, software_input_on: Enable,
pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: Normal, slew_rate:
Slow}
  - {pin_num: L13, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AD_24, pull_up_down_config: Pull_Down,
pull_keeper_select: Keeper, open_drain: Disable, drive_strength: Normal, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLpuartPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLpuartPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc); /* LPCG on: LPCG is ON. */

#if DEBUG_CONSOLE_UART_INDEX == 1
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_24_LPUART1_TXD, /* GPIO_AD_24 is configured as LPUART1_TXD */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_25_LPUART1_RXD,    /* GPIO_AD_25 is configured as LPUART1_RXD */
                     1U);                              /* Software Input On Field: Force input path of pad GPIO_AD_25 */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_24_LPUART1_TXD, /* GPIO_AD_24 PAD functional properties : */
                        0x00U);                        /* Slew Rate Field: Slow Slew Rate
                                                          Drive Strength Field: normal drive strength
                                                          Pull / Keep Select Field: Pull Disable, Highz
                                                          Pull Up / Down Config. Field: Weak pull down
                                                          Open Drain Field: Disabled
                                                          Domain write protection: Both cores are allowed
                                                          Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_25_LPUART1_RXD, /* GPIO_AD_25 PAD functional properties : */
                        0x00U);                        /* Slew Rate Field: Slow Slew Rate
                                                          Drive Strength Field: normal drive strength
                                                          Pull / Keep Select Field: Pull Disable, Highz
                                                          Pull Up / Down Config. Field: Weak pull down
                                                          Open Drain Field: Disabled
                                                          Domain write protection: Both cores are allowed
                                                          Domain write protection lock: Neither of DWP bits is locked */
#elif DEBUG_CONSOLE_UART_INDEX == 12
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_00_LPUART12_TXD, /* GPIO_AD_25 PAD functional properties : */
                           0x00U);                        /* Slew Rate Field: Slow Slew Rate
                                                             Drive Strength Field: normal drive strength
                                                             Pull / Keep Select Field: Pull Disable, Highz
                                                             Pull Up / Down Config. Field: Weak pull down
                                                             Open Drain Field: Disabled
                                                             Domain write protection: Both cores are allowed
                                                             Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_01_LPUART12_RXD, /* GPIO_AD_25 PAD functional properties : */
                           0x00U);                        /* Slew Rate Field: Slow Slew Rate
                                                             Drive Strength Field: normal drive strength
                                                             Pull / Keep Select Field: Pull Disable, Highz
                                                             Pull Up / Down Config. Field: Weak pull down
                                                             Open Drain Field: Disabled
                                                             Domain write protection: Both cores are allowed
                                                             Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_00_LPUART12_TXD, /* GPIO_LPSR_00 is configured as LPUART12_TXD */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_01_LPUART12_RXD, /* GPIO_LPSR_01 is configured as LPUART12_RXD */
                     1U); /* Software Input On Field: Force input path of pad GPIO_AD_25 */
#endif
}

