sengeiou/sln_tlhmi_iot/cm4/board/pin_mux.c
    /*
     * MIPI Panel Touch Pins
     */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_11_GPIO8_IO21, 0U); // TOUCH_RST
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_10_GPIO8_IO20, 0U); // TOUCH_INT

    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_04_LPI2C5_SDA, 1U); // TOUCH_I2C
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_05_LPI2C5_SCL, 1U); // TOUCH_I2C

    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_04_LPI2C5_SDA, /* GPIO_LPSR_04 PAD functional properties : */
                        0x20U);                         /* Slew Rate Field: Slow Slew Rate
                                                           Drive Strength Field: normal driver
                                                           Pull / Keep Select Field: Pull Disable
                                                           Pull Up / Down Config. Field: Weak pull down
                                                           Open Drain LPSR Field: Enabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_05_LPI2C5_SCL, /* GPIO_LPSR_05 PAD functional properties : */
                        0x20U);                         /* Slew Rate Field: Slow Slew Rate
                                                           Drive Strength Field: normal driver
                                                           Pull / Keep Select Field: Pull Disable
                                                           Pull Up / Down Config. Field: Weak pull down
                                                           Open Drain LPSR Field: Enabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */
#endif
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMipiCameraPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: L14, peripheral: GPIO9, signal: 'gpio_io, 25', pin_signal: GPIO_AD_26, direction: OUTPUT}
  - {pin_num: A7, peripheral: GPIO11, signal: 'gpio_io, 15', pin_signal: GPIO_DISP_B2_14, direction: OUTPUT}
  - {pin_num: R8, peripheral: LPI2C6, signal: SCL, pin_signal: GPIO_LPSR_07, software_input_on: Enable}
  - {pin_num: P8, peripheral: LPI2C6, signal: SDA, pin_signal: GPIO_LPSR_06, software_input_on: Enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMipiCameraPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitMipiCameraPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc);      /* LPCG on: LPCG is ON. */
    CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr); /* LPCG on: LPCG is ON. */

    /* GPIO configuration of CAMERA_PWDN on GPIO_AD_26 (pin L14) */
    gpio_pin_config_t CAMERA_PWDN_config = {
        .direction = kGPIO_DigitalOutput, .outputLogic = 0U, .interruptMode = kGPIO_NoIntmode};
    /* Initialize GPIO functionality on GPIO_AD_26 (pin L14) */
    GPIO_PinInit(GPIO9, 25U, &CAMERA_PWDN_config);

    /* GPIO configuration of CAMERA_RST on GPIO_DISP_B2_14 (pin A7) */
    gpio_pin_config_t CAMERA_RST_config = {
        .direction = kGPIO_DigitalOutput, .outputLogic = 0U, .interruptMode = kGPIO_NoIntmode};
    /* Initialize GPIO functionality on GPIO_DISP_B2_14 (pin A7) */
    GPIO_PinInit(GPIO11, 15U, &CAMERA_RST_config);

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_26_GPIO9_IO25, /* GPIO_AD_26 is configured as GPIO9_IO25 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B2_14_GPIO11_IO15, /* GPIO_DISP_B2_14 is configured as GPIO11_IO15 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_06_LPI2C6_SDA, /* GPIO_LPSR_06 is configured as LPI2C6_SDA */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_06 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_07_LPI2C6_SCL, /* GPIO_LPSR_07 is configured as LPI2C6_SCL */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_07 */
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitParallelCameraPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitParallelCameraPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc);      /* LPCG on: LPCG is ON. */
    CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr); /* LPCG on: LPCG is ON. */

    /* I2C Setting Interface */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_06_LPI2C6_SDA, /* GPIO_LPSR_06 is configured as LPI2C6_SDA */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_06 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_07_LPI2C6_SCL, /* GPIO_LPSR_07 is configured as LPI2C6_SCL */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_07 */

    /*3DIC_PWR */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_06_DIG_GPIO13_IO09, /* GPIO_SNVS_06_DIG is configured as GPIO13_IO09 */
                     0U);
    /* IR_RESET */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_14_GPIO_MUX2_IO24, /* GPIO_EMC_B2_14 is configured as GPIO_MUX2_IO24*/
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_GPR->GPR41 =
        ((IOMUXC_GPR->GPR41 &
          (~(IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
         | IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH(
               0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
        );

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_12_VIDEO_MUX_CSI_PIXCLK, /* GPIO_AD_12 is configured as VIDEO_MUX_CSI_PIXCLK */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_13_VIDEO_MUX_CSI_MCLK, /* GPIO_AD_13 is configured as VIDEO_MUX_CSI_MCLK */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_14_VIDEO_MUX_CSI_VSYNC, /* GPIO_AD_14 is configured as VIDEO_MUX_CSI_VSYNC */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_15_VIDEO_MUX_CSI_HSYNC, /* GPIO_AD_15 is configured as VIDEO_MUX_CSI_HSYNC */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_16_VIDEO_MUX_CSI_DATA09, /* GPIO_AD_16 is configured as VIDEO_MUX_CSI_DATA09 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_17_VIDEO_MUX_CSI_DATA08, /* GPIO_AD_17 is configured as VIDEO_MUX_CSI_DATA08 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_18_VIDEO_MUX_CSI_DATA07, /* GPIO_AD_18 is configured as VIDEO_MUX_CSI_DATA07 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_19_VIDEO_MUX_CSI_DATA06, /* GPIO_AD_19 is configured as VIDEO_MUX_CSI_DATA06 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_20_VIDEO_MUX_CSI_DATA05, /* GPIO_AD_20 is configured as VIDEO_MUX_CSI_DATA05 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_21_VIDEO_MUX_CSI_DATA04, /* GPIO_AD_21 is configured as VIDEO_MUX_CSI_DATA04 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_22_VIDEO_MUX_CSI_DATA03, /* GPIO_AD_22 is configured as VIDEO_MUX_CSI_DATA03 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_23_VIDEO_MUX_CSI_DATA02, /* GPIO_AD_23 is configured as VIDEO_MUX_CSI_DATA02 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_06_LPI2C6_SDA, /* GPIO_LPSR_06 PAD functional properties : */
                        0x20U);                         /* Slew Rate Field: Slow Slew Rate
                                                           Drive Strength Field: high driver
                                                           Pull / Keep Select Field: Pull Enable
                                                           Pull Up / Down Config. Field: Weak pull up
                                                           Open Drain LPSR Field: Enabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_07_LPI2C6_SCL, /* GPIO_LPSR_07 PAD functional properties : */
                        0x20U);                         /* Slew Rate Field: Slow Slew Rate
                                                           Drive Strength Field: high driver
                                                           Pull / Keep Select Field: Pull Enable
                                                           Pull Up / Down Config. Field: Weak pull up
                                                           Open Drain LPSR Field: Enabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */

